       IDENTIFICATION DIVISION.
       PROGRAM-ID. GPA-CALCULATOR.
       AUTHOR. MARVINJASON.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 UNFORMATTED.
       	02 UNITS	PIC 9(2)		VALUE 0.
       	02 GRADES	PIC 9(2)V9(2)	VALUE 0.
       01 FORMATTED.
       	02 GRADES-F	PIC 9(2).9(2)	VALUE 0.
       	02 GPA		PIC 9(1).9(2)	VALUE 0.
       01 TEMPORARY.
       	02 TEMP1	PIC 9(1)		VALUE 0.
       	02 TEMP2	PIC 9(2)V9(1)	VALUE 0.
       
       SCREEN SECTION.
       01 INPUT-SCREEN
       	BLANK SCREEN, AUTO, REQUIRED,
       	FOREGROUND-COLOR IS 7,
       	BACKGROUND-COLOR IS 1.
       	02 LINE 03 COLUMN 05 VALUE 'UNIT:'.
       	02 LINE 03 COLUMN 11 PIC 9(1) TO TEMP1.
       	02 LINE 05 COLUMN 05 VALUE 'GRADE:'.
       	02 LINE 05 COLUMN 12 PIC 9(1).9(1) TO TEMP2.
       	02 LINE 08 COLUMN 05 VALUE 'TOTAL UNIT: '.
       	02 LINE 08 COLUMN 18 PIC Z9(1) FROM UNITS.
       	02 LINE 10 COLUMN 05 VALUE 'TOTAL GRADE: '.
       	02 LINE 10 COLUMN 19 PIC 9(2).9(2) FROM GRADES-F.
       	02 LINE 12 COLUMN 05 VALUE 'GPA: '.
       	02 LINE 12 COLUMN 11 PIC 9(1).9(2) FROM GPA.
       
       PROCEDURE DIVISION.
       MAIN-PARA.
       	PERFORM LOOP-PARA UNTIL 1 NOT = 1.
       	STOP RUN.
       
       LOOP-PARA.
       	DISPLAY INPUT-SCREEN.
       	ACCEPT INPUT-SCREEN.
       	ADD TEMP1 TO UNITS.
       	MULTIPLY TEMP1 BY TEMP2.
       	ADD TEMP2 TO GRADES.
       	MOVE GRADES TO GRADES-F.
       	DIVIDE UNITS INTO GRADES GIVING GPA.