       IDENTIFICATION DIVISION.
       PROGRAM-ID. TICKETING-SYSTEM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       	 SELECT RECEIPT-FILE
       	 	ASSIGN TO "RECEIPT.TXT"
       	 	ORGANIZATION IS LINE SEQUENTIAL.
       
       DATA DIVISION.
       FILE SECTION.
       FD RECEIPT-FILE.
       01 LABEL-RECORDS.
       	03 LABEL-TRANS PIC X(4).
       	03 LABEL-FILLER PIC X(2).
       	03 LABEL-DEPARTURE PIC X(5).
       	03 LABEL-ARRIVAL PIC X(4).
       	03 LABEL-AMOUNT PIC X(5).
        	
       01 RECEIPT-RECORDS.
       	03 RECEIPT-REC-TRANS-NUM PIC 9(4). 
       	03 FILL-SPACES PIC X(3) VALUE SPACES.
       	03 RECEIPT-REC-DEPARTURE PIC A(4).
       	03 RECEIPT-REC-ARRIVAL PIC A(4).
       	03 RECEIPT-REC-AMOUNT PIC Z,ZZ9.
       
       01 RECEIPT-RECORDS-AMOUNT.
       	03 RECEIPT-SPACES PIC X(12).
       	03 RECEIPT-TOTAL-AMOUNT PIC Z,ZZ9.00.
       
      
       	
       WORKING-STORAGE SECTION.
       01 MATRIX-STRING.
       	03 FILLER PIC X(5) VALUE "RE 00".
       	03 FILLER PIC X(5) VALUE "LE 15".
       	03 FILLER PIC X(5) VALUE "PU 15".
       	03 FILLER PIC X(5) VALUE "VM 15".
       	03 FILLER PIC X(5) VALUE "JR 20".
       	03 FILLER PIC X(5) VALUE "GI 20".
       	03 FILLER PIC X(5) VALUE "BG 20".
       	03 FILLER PIC X(5) VALUE "AC 20".
       	03 FILLER PIC X(5) VALUE "AN 25".
       	03 FILLER PIC X(5) VALUE "KA 25".
       	03 FILLER PIC X(5) VALUE "SA 25".
       
       01 MATRIX REDEFINES MATRIX-STRING.
       	03 MATRIX-STRING-SEPARATE OCCURS 11 TIMES.
       		05 LRT-STATION	PIC A(2).
       		05 FILLER PIC X.
       		05 LRT-STATION-PRICE PIC 9(2).
       		
       01 BUY-TICKET-PARA-DATA-ITEMS.
       	03 DEPARTURE-POINT PIC A(2) VALUE SPACES.
       	03 ARRIVAL-POINT PIC A(2) VALUE SPACES.
       	03 AMOUNT.
       		05 TEMP-AMOUNT PIC 9(3) VALUE ZEROES.
       		05 FINAL-AMOUNT PIC ZZ9 VALUE ZEROES.
       	03 NUM-OF-TICKETS PIC 99 VALUE ZEROES.
       	03 TRANS-NUM PIC 9(4) VALUE ZEROES.
       
       01 RECEIPT-DATA-ITEMS.
       	03 SUMMARY OCCURS 10 TIMES.
       		05 SUMMARY-TRANS-NUM PIC 9(4).
       		05 SUMMARY-DEPARTURE PIC A(2).
       		05 SUMMARY-ARRIVAL PIC A(2).
       		05 SUMMARY-AMOUNT PIC ZZ9.
       	03 TEMP-TOTAL-AMOUNT PIC 9(4).
       	03 TOTAL-AMOUNT PIC Z,Z99.00.
       
       01 COUNTERS.
       	03 DISPLAY-MATRIX-CTR PIC 9(2) VALUE ZEROES.
       	03 STATION-CHECK-CTR1 PIC 9(2) VALUE 1.
       	03 STATION-CHECK-CTR2 PIC 9(2) VALUE 2.
       	03 TRANS-CTR PIC 9(2) VALUE ZEROES.
       	03 RANDOM-CTR PIC 99 VALUE ZEROES.
      
       01 CHOICES.
       	03 TEMP-CHOICE PIC 9.
       	03 MAIN-MENU-CHOICE PIC 9.
       		88 MENU-BUY	VALUE 1.
       		88 MENU-RECEIPT VALUE 2.
       		88 MENU-EXIT VALUE 3.
       		88 VALID-CHOICE VALUE 1 THRU 3.
       	03 CONTINUE-CHOICE PIC X VALUE SPACES.
       	03 PRINT-RECEIPT-CHOICE PIC X VALUE SPACES.
       	03 CHOICE-TRANSAC PIC A.
       
       01 CASE-CONVERSION.
       	03 LOWERCASE PIC A(26) VALUE 'abcdefghijklmnopqrstuvwxyz'.
       	03 UPPERCASE PIC A(26) VALUE 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'.
       
       
       SCREEN SECTION.
      
       01 MAIN-MENU-SCREEN
       	BLANK SCREEN, AUTO, REQUIRED,
       	FOREGROUND-COLOR IS 7,
       	BACKGROUND-COLOR IS 1.
       	02 LINE 02 COLUMN 23 VALUE 'WELCOME TO LRT TICKETING SYSTEM'.
       	02 LINE 05 COLUMN 25 VALUE '[1] BUY TICKET'.
       	02 LINE 06 COLUMN 25 VALUE '[2] GET RECEIPT'.
       	02 LINE 07 COLUMN 25 VALUE '[3] EXIT'.
       	02 LINE 08 COLUMN 46 PIC 9 USING TEMP-CHOICE.
       	02 LINE 08 COLUMN 20 VALUE 'PLEASE CHOOSE AN OPTION:'.
       01 BUY-TICKET-SCREEN
       	BLANK SCREEN, AUTO, REQUIRED,
       	FOREGROUND-COLOR IS 7,
       	BACKGROUND-COLOR IS 1.
       	02 LINE 04 COLUMN 20 VALUE 'LRT2 SINGLE JOURNEY FARE MATRIX'.
       	02 LINE 08 COLUMN 2 VALUE 'RECTO'.
       	02 LINE 09 COLUMN 2 VALUE 'LEGARDA'.
       	02 LINE 10 COLUMN 2 VALUE 'PUREZA'.
       	02 LINE 11 COLUMN 2 VALUE 'V-MAPA'.
       	02 LINE 12 COLUMN 2 VALUE 'J-RUIZ'.
       	02 LINE 13 COLUMN 2 VALUE 'GILMORE'.
       	02 LINE 14 COLUMN 2 VALUE 'BETTY-GO'.
       	02 LINE 15 COLUMN 2 VALUE 'CUBAO'.
       	02 LINE 16 COLUMN 2 VALUE 'ANONAS'.
       	02 LINE 17 COLUMN 2 VALUE 'KATIPUNAN'.
       	02 LINE 18 COLUMN 2 VALUE 'SANTOLAN'.
       	02 LINE 07 COLUMN 13 VALUE 'RE'.
       	02 LINE 07 COLUMN 17 VALUE 'LE'.
       	02 LINE 07 COLUMN 21 VALUE 'PU'.
       	02 LINE 07 COLUMN 25 VALUE 'VM'.
       	02 LINE 07 COLUMN 29 VALUE 'JR'.
       	02 LINE 07 COLUMN 33 VALUE 'GI'.
       	02 LINE 07 COLUMN 37 VALUE 'BG'.
       	02 LINE 07 COLUMN 41 VALUE 'AC'.
       	02 LINE 07 COLUMN 45 VALUE 'AN'.
       	02 LINE 07 COLUMN 49 VALUE 'KN'.
       	02 LINE 07 COLUMN 53 VALUE 'SA'.
       	02 LINE 09 COLUMN 13 VALUE  '15'.
       	02 LINE 10 COLUMN 13 VALUE  '15'.
       	02 LINE 11 COLUMN 13 VALUE  '15'.
       	02 LINE 12 COLUMN 13 VALUE  '20'.
       	02 LINE 13 COLUMN 13 VALUE  '20'.
       	02 LINE 14 COLUMN 13 VALUE  '20'.
       	02 LINE 15 COLUMN 13 VALUE  '20'.
       	02 LINE 16 COLUMN 13 VALUE  '25'.
       	02 LINE 17 COLUMN 13 VALUE  '25'.
       	02 LINE 18 COLUMN 13 VALUE  '25'.
       	02 LINE 08 COLUMN 17 VALUE  '15'.
       	02 LINE 10 COLUMN 17 VALUE  '15'.
       	02 LINE 11 COLUMN 17 VALUE  '15'.
       	02 LINE 12 COLUMN 17 VALUE  '15'.
       	02 LINE 13 COLUMN 17 VALUE  '20'.
       	02 LINE 14 COLUMN 17 VALUE  '20'.
       	02 LINE 15 COLUMN 17 VALUE  '20'.
       	02 LINE 16 COLUMN 17 VALUE  '20'.
       	02 LINE 17 COLUMN 17 VALUE  '25'.
       	02 LINE 18 COLUMN 17 VALUE  '25'.
       	02 LINE 08 COLUMN 21 VALUE  '15'.
       	02 LINE 09 COLUMN 21 VALUE  '15'.
       	02 LINE 11 COLUMN 21 VALUE  '15'.
       	02 LINE 12 COLUMN 21 VALUE  '15'.
       	02 LINE 13 COLUMN 21 VALUE  '15'.
       	02 LINE 14 COLUMN 21 VALUE  '20'.
       	02 LINE 15 COLUMN 21 VALUE  '20'.
       	02 LINE 16 COLUMN 21 VALUE  '20'.
       	02 LINE 17 COLUMN 21 VALUE  '20'.
       	02 LINE 18 COLUMN 21 VALUE  '25'.
       	02 LINE 08 COLUMN 25 VALUE  '15'.
       	02 LINE 09 COLUMN 25 VALUE  '15'.
       	02 LINE 10 COLUMN 25 VALUE  '15'.
       	02 LINE 12 COLUMN 25 VALUE  '15'.
       	02 LINE 13 COLUMN 25 VALUE  '15'.
       	02 LINE 14 COLUMN 25 VALUE  '15'.
       	02 LINE 15 COLUMN 25 VALUE  '20'.
       	02 LINE 16 COLUMN 25 VALUE  '20'.
       	02 LINE 17 COLUMN 25 VALUE  '20'.
       	02 LINE 18 COLUMN 25 VALUE  '25'.
       	02 LINE 08 COLUMN 29 VALUE  '20'.
       	02 LINE 09 COLUMN 29 VALUE  '15'.
       	02 LINE 10 COLUMN 29 VALUE  '15'.
       	02 LINE 11 COLUMN 29 VALUE  '15'.
       	02 LINE 13 COLUMN 29 VALUE  '15'.
       	02 LINE 14 COLUMN 29 VALUE  '15'.
       	02 LINE 15 COLUMN 29 VALUE  '15'.
       	02 LINE 16 COLUMN 29 VALUE  '20'.
       	02 LINE 17 COLUMN 29 VALUE  '20'.
       	02 LINE 18 COLUMN 29 VALUE  '20'.
       	02 LINE 08 COLUMN 33 VALUE  '20'.
       	02 LINE 09 COLUMN 33 VALUE  '20'.
       	02 LINE 10 COLUMN 33 VALUE  '15'.
       	02 LINE 11 COLUMN 33 VALUE  '15'.
       	02 LINE 12 COLUMN 33 VALUE  '15'.
       	02 LINE 14 COLUMN 33 VALUE  '15'.
       	02 LINE 15 COLUMN 33 VALUE  '15'.
       	02 LINE 16 COLUMN 33 VALUE  '15'.
       	02 LINE 17 COLUMN 33 VALUE  '20'.
       	02 LINE 18 COLUMN 33 VALUE  '20'.
       	02 LINE 08 COLUMN 37 VALUE  '20'.
       	02 LINE 09 COLUMN 37 VALUE  '20'.
       	02 LINE 10 COLUMN 37 VALUE  '20'.
       	02 LINE 11 COLUMN 37 VALUE  '15'.
       	02 LINE 12 COLUMN 37 VALUE  '15'.
       	02 LINE 13 COLUMN 37 VALUE  '15'.
       	02 LINE 15 COLUMN 37 VALUE  '15'.
       	02 LINE 16 COLUMN 37 VALUE  '15'.
       	02 LINE 17 COLUMN 37 VALUE  '15'.
       	02 LINE 18 COLUMN 37 VALUE  '20'.
       	02 LINE 08 COLUMN 41 VALUE  '20'.
       	02 LINE 09 COLUMN 41 VALUE  '20'.
       	02 LINE 10 COLUMN 41 VALUE  '20'.
       	02 LINE 11 COLUMN 41 VALUE  '20'.
       	02 LINE 12 COLUMN 41 VALUE  '15'.
       	02 LINE 13 COLUMN 41 VALUE  '15'.
       	02 LINE 14 COLUMN 41 VALUE  '15'.
       	02 LINE 16 COLUMN 41 VALUE  '15'.
       	02 LINE 17 COLUMN 41 VALUE  '15'.
       	02 LINE 18 COLUMN 41 VALUE  '15'.
       	02 LINE 08 COLUMN 45 VALUE  '25'.
       	02 LINE 09 COLUMN 45 VALUE  '20'.
       	02 LINE 10 COLUMN 45 VALUE  '20'.
       	02 LINE 11 COLUMN 45 VALUE  '20'.
       	02 LINE 12 COLUMN 45 VALUE  '20'.
       	02 LINE 13 COLUMN 45 VALUE  '15'.
       	02 LINE 14 COLUMN 45 VALUE  '15'.
       	02 LINE 15 COLUMN 45 VALUE  '15'.
       	02 LINE 17 COLUMN 45 VALUE  '15'.
       	02 LINE 18 COLUMN 45 VALUE  '15'.
       	02 LINE 08 COLUMN 49 VALUE  '25'.
       	02 LINE 09 COLUMN 49 VALUE  '25'.
       	02 LINE 10 COLUMN 49 VALUE  '20'.
       	02 LINE 11 COLUMN 49 VALUE  '20'.
       	02 LINE 12 COLUMN 49 VALUE  '20'.
       	02 LINE 13 COLUMN 49 VALUE  '20'.
       	02 LINE 14 COLUMN 49 VALUE  '15'.
       	02 LINE 15 COLUMN 49 VALUE  '15'.
       	02 LINE 16 COLUMN 49 VALUE  '15'.
       	02 LINE 18 COLUMN 49 VALUE  '15'.
       	02 LINE 08 COLUMN 53 VALUE  '25'.
       	02 LINE 09 COLUMN 53 VALUE  '25'.
       	02 LINE 10 COLUMN 53 VALUE  '25'.
       	02 LINE 11 COLUMN 53 VALUE  '25'.
       	02 LINE 12 COLUMN 53 VALUE  '20'.
       	02 LINE 13 COLUMN 53 VALUE  '20'.
       	02 LINE 14 COLUMN 53 VALUE  '20'.
       	02 LINE 15 COLUMN 53 VALUE  '15'.
       	02 LINE 16 COLUMN 53 VALUE  '15'.
       	02 LINE 17 COLUMN 53 VALUE  '15'.
       	02 LINE 20 COLUMN 29 VALUE "TRANSACTION NO: ".
       	02 LINE 20 COLUMN 45 PIC 9(4) FROM TRANS-NUM.
       	02 LINE 21 COLUMN 15 VALUE "PLEASE CHOOSE YOUR"
      -			"DEPARTURE POINT AND ARRIVAL POINT: ".
      	02 LINE 22 COLUMN 15 VALUE "DEPARTURE POINT: ".
      	02 LINE 23 COLUMN 15 DISPLAY "ARRIVAL POINT: ".
      	02 LINE 24 COLUMN 15 DISPLAY "HOW MANY TICKETS?: ".
       01 DEPARTURE-ACCEPT.
      	02 LINE 22 COLUMN 34 PIC X(2) TO DEPARTURE-POINT.
       01 DEPARTURE-ERROR.
       	02 LINE 22 COLUMN 34 VALUE "INVALID DEPARTURE STATION! ".
       01 ARRIVAL-ACCEPT.
          02 LINE 23 COLUMN 34 PIC X(2) TO ARRIVAL-POINT.
       01 ARRIVAL-ERROR.
          02 LINE 23 COLUMN 34 VALUE "INVALID ARRIVAL STATION! ".
       01 NUM-OF-TIX.
       	02 LINE 24 COLUMN 34 PIC 99 TO NUM-OF-TICKETS.
       01 SUMMARY-OUT-SCREEN
       	BLANK SCREEN.
       	02 LINE 04 COLUMN 15 DISPLAY "TOTAL AMOUNT: ".
       	02 LINE 04 COLUMN 34 PIC 999 FROM FINAL-AMOUNT.
      	02 LINE 05 COLUMN 15 DISPLAY "HAVE A SAFE TRIP!".
       01 CONT2.
       	02 LINE 25 COLUMN 15 VALUE "DO YOU WANT ANOTHER ".
      	02 LINE 25 COLUMN 35 VALUE "TRANSACTION? [Y/N]: ".
      	02 LINE 25 COLUMN 54 PIC X TO CONTINUE-CHOICE.
       01 TOTAL-AMOUNT-SCREEN
       	BLANK SCREEN.
       	02 LINE 02 COLUMN 10 VALUE "TOTAL AMOUNT: PHP ".
      	02 LINE 02 COLUMN 27 PIC 9(3) FROM TOTAL-AMOUNT.
      	02 LINE 03 COLUMN 10 VALUE "PRINT RECEIPT? [Y/N]: ".
      	02 LINE 03 COLUMN 31 PIC X TO PRINT-RECEIPT-CHOICE.
       01 YES.
       	02 LINE 04 COLUMN 31 DISPLAY "RECEIPT IS PRINTED!".
       01 INVALID-INPUT.
       	02 LINE 22 COLUMN 34 VALUE "SAME STATIONS!".
      	02 LINE 23 COLUMN 34 VALUE "SAME STATIONS!".
      	
       PROCEDURE DIVISION.
       
       MAIN-RTN.
       	 PERFORM MAIN-MENU-PARA UNTIL MAIN-MENU-CHOICE = 3.
       	 STOP RUN.
       	 
       MAIN-MENU-PARA.
      * 	 DISPLAY ERASE.
      * 	 DISPLAY MAIN-SCREEN.
      
      	 DISPLAY MAIN-MENU-SCREEN.
      	 ACCEPT MAIN-MENU-SCREEN.
      * 	 DISPLAY "WELCOME TO LRT TICKETING SYSTEM. ".
      * 	 DISPLAY "[1] BUY TICKET ".
      * 	 DISPLAY "[2] FARE MATRIX ".
      * 	 DISPLAY "[3] GET RECEIPT ".
      * 	 DISPLAY "[4] EXIT "
      * 	 DISPLAY "PLEASE CHOOSE AN OPTION: " WITH NO ADVANCING.
       	 MOVE TEMP-CHOICE TO MAIN-MENU-CHOICE.
       	 
       	 IF VALID-CHOICE
       	 	IF MENU-BUY
       	 		PERFORM BUY-TICKET-PARA UNTIL CONTINUE-
      -				CHOICE = 'N'
       	 		CONTINUE
      * 	 	ELSE IF MENU-MATRIX
      * 	 		PERFORM FARE-MATRIX-PARA
       	 		CONTINUE
       	 	ELSE IF MENU-RECEIPT
       	 		PERFORM RECEIPT-PARA
       	 		CONTINUE
       	 	ELSE
       	 		DISPLAY " " LINE 20 COLUMN 20 
       	 		STOP RUN
       	 	END-IF
       	 ELSE
       	 	DISPLAY "INVALID CHOICE"
       	 	GO TO MAIN-MENU-PARA
       	 END-IF.
       	 
       
       BUY-TICKET-PARA.
       	DISPLAY ERASE.
       	IF STATION-CHECK-CTR1 = STATION-CHECK-CTR2
       		DISPLAY INVALID-INPUT.
       	ADD 1 TO TRANS-NUM.
      * 	DISPLAY "TRANSACTION NO: " TRANS-NUM.
      * 	DISPLAY " ".
      *
      *-			" AND ARRIVAL POINT: ".
      *	DISPLAY " ".
      *	DISPLAY "DEPARTURE POINT: " WITH NO ADVANCING.
      *	ACCEPT DEPARTURE-POINT.
      	DISPLAY BUY-TICKET-SCREEN.
      	ACCEPT DEPARTURE-ACCEPT.
      	INSPECT DEPARTURE-POINT CONVERTING LOWERCASE TO UPPERCASE.
      	
      		PERFORM VARYING STATION-CHECK-CTR1 FROM 1 BY 1 
       	 		UNTIL STATION-CHECK-CTR1 = 12 
       	 		OR DEPARTURE-POINT = LRT-
      -			STATION(STATION-CHECK-CTR1)
       	 		
       	 		CONTINUE
      		END-PERFORM.
      	
      		IF STATION-CHECK-CTR1 = 12
      			DISPLAY DEPARTURE-ERROR
      			SUBTRACT 1 FROM TRANS-NUM
      			PERFORM CONTINUE2-RTN
      			GO TO BUY-TICKET-PARA
      		END-IF.
      		
      	
      	ACCEPT ARRIVAL-ACCEPT.
      	INSPECT ARRIVAL-POINT CONVERTING LOWERCASE TO UPPERCASE.
      	
      		PERFORM VARYING STATION-CHECK-CTR2 FROM 1 BY 1 
       	 		UNTIL STATION-CHECK-CTR2 = 12 
       	 		OR ARRIVAL-POINT = LRT-
      -			STATION(STATION-CHECK-CTR2)
       	 		
       	 		CONTINUE
      		END-PERFORM.
      	
      	IF STATION-CHECK-CTR2 = 12
      		SUBTRACT 1 FROM TRANS-NUM
      		GO TO BUY-TICKET-PARA
      	
      	ELSE IF STATION-CHECK-CTR1 = STATION-CHECK-CTR2
      		SUBTRACT 1 FROM TRANS-NUM
      		DISPLAY INVALID-INPUT
      		PERFORM CONTINUE2-RTN
      		GO TO BUY-TICKET-PARA
      	
      	ELSE
      		MOVE ZEROES TO TEMP-AMOUNT
      		
      		ACCEPT NUM-OF-TIX
      		PERFORM COMPUTING-TICKET-PRICE-PAR
      		MULTIPLY NUM-OF-TICKETS BY TEMP-AMOUNT
      		MOVE TEMP-AMOUNT TO FINAL-AMOUNT
      		DISPLAY SUMMARY-OUT-SCREEN
      *		FOR SUMMARY
      		ADD 1 TO TRANS-CTR
      		MOVE TRANS-NUM TO SUMMARY-TRANS-NUM(TRANS-CTR)
       	 	MOVE DEPARTURE-POINT TO SUMMARY-DEPARTURE(TRANS-CTR)
       	 	MOVE ARRIVAL-POINT TO SUMMARY-ARRIVAL(TRANS-CTR)
       	 	MOVE TEMP-AMOUNT TO SUMMARY-AMOUNT(TRANS-CTR)
       	 	ADD TEMP-AMOUNT TO TEMP-TOTAL-AMOUNT
       	 	
       	 	
      		 
      	END-IF.
      	PERFORM CONTINUE2-RTN.
      	
      	
       
       	
      * FARE-MATRIX-PARA.
      * 	PERFORM FARE-MATRIX-RTN VARYING DISPLAY-MATRIX-CTR
      * 		FROM 1 BY 1 UNTIL DISPLAY-MATRIX-CTR = 12.
      * 	PERFORM CONT2.
      * 	
      * 	
      * 	
      * 	
      * FARE-MATRIX-RTN.
      * 	DISPLAY FARE-MATRIX-SCREEN.
      	
      	
      	
      	
       RECEIPT-PARA.
       	 PERFORM DISP-SUMMARY-RTN VARYING RANDOM-CTR FROM 1 BY 1 
       	 UNTIL RANDOM-CTR > TRANS-CTR.
       	 MOVE TEMP-TOTAL-AMOUNT TO TOTAL-AMOUNT.
       	 DISPLAY TOTAL-AMOUNT-SCREEN.
      	 ACCEPT TOTAL-AMOUNT-SCREEN.
      	 INSPECT PRINT-RECEIPT-CHOICE
      	 	CONVERTING LOWERCASE TO UPPERCASE.
      	 
      	 IF PRINT-RECEIPT-CHOICE = 'Y'
      	 	PERFORM PRINT-RECEIPT-RTN
      	 	DISPLAY YES
      	 	CONTINUE
      	 ELSE
      	 	CONTINUE
      	 END-IF.
      	 PERFORM CONTINUE2-RTN.
      	 
      	 
      	 
      	 
       DISP-SUMMARY-RTN.
       	 DISPLAY "      " SUMMARY-TRANS-NUM(RANDOM-CTR)
      - "                  " SUMMARY-DEPARTURE(RANDOM-CTR)
      - "                  " SUMMARY-ARRIVAL(RANDOM-CTR) 
      - "    " SUMMARY-AMOUNT(RANDOM-CTR).
       
       
       PRINT-RECEIPT-RTN.
       	 MOVE ZEROES TO RANDOM-CTR.
       	 MOVE "TNUM" TO LABEL-TRANS.
       	 MOVE SPACES TO LABEL-FILLER.
       	 MOVE "FROM " TO LABEL-DEPARTURE.
       	 MOVE " TO " TO LABEL-ARRIVAL.
       	 MOVE "PRICE" TO LABEL-AMOUNT.
       	 OPEN EXTEND RECEIPT-FILE
       	 	WRITE LABEL-RECORDS
       	 CLOSE RECEIPT-FILE.
       	 PERFORM VARYING RANDOM-CTR FROM 1 BY 1
       	 	UNTIL RANDOM-CTR > TRANS-CTR
       	 		MOVE SUMMARY-TRANS-NUM(RANDOM-CTR) TO RECEIPT-
      -				REC-TRANS-NUM
       	 		MOVE SUMMARY-DEPARTURE(RANDOM-CTR) TO RECEIPT-
      -				REC-DEPARTURE
       			MOVE SUMMARY-ARRIVAL(RANDOM-CTR) TO RECEIPT-
      -				REC-ARRIVAL
       			MOVE SUMMARY-AMOUNT(RANDOM-CTR) TO RECEIPT-
      -				REC-AMOUNT
      		OPEN EXTEND RECEIPT-FILE
      	 		WRITE RECEIPT-RECORDS
      	 	CLOSE RECEIPT-FILE
       	 END-PERFORM.
       	 MOVE TOTAL-AMOUNT TO RECEIPT-TOTAL-AMOUNT.
       	 MOVE "TOTAL AMOUNT" TO RECEIPT-SPACES.
      	 OPEN EXTEND RECEIPT-FILE
      	 	WRITE RECEIPT-RECORDS-AMOUNT
      	 CLOSE RECEIPT-FILE.
       	
       	
       	
       	
       	
      
      
       CONTINUE2-RTN.
       	DISPLAY CONT2.
       	ACCEPT CONT2.
       	INSPECT CONTINUE-CHOICE CONVERTING LOWERCASE TO UPPERCASE.
       
       COMPUTING-TICKET-PRICE-PAR.
      	 IF DEPARTURE-POINT = 'RE'
       		IF ARRIVAL-POINT = 'LE' OR 'PU' OR 'VM'
       			ADD 15 TO TEMP-AMOUNT
       		ELSE IF ARRIVAL-POINT = 'JR' OR 'GI' OR 'BG' OR 'AC'
       			ADD 20 TO TEMP-AMOUNT
       		ELSE 
       			ADD 25 TO TEMP-AMOUNT
       		END-IF
       			
        	 ELSE IF DEPARTURE-POINT = 'LE'
       		IF ARRIVAL-POINT = 'RE' OR 'PU' OR 'VM' OR 'JR'
       			ADD 15 TO TEMP-AMOUNT
       		ELSE IF ARRIVAL-POINT = 'GI' OR 'BG' OR 'AC' OR 'AN'
       			ADD 20 TO TEMP-AMOUNT
       		ELSE 
       			ADD 25 TO TEMP-AMOUNT
       		END-IF
       			
       	 ELSE IF DEPARTURE-POINT = 'PU'
       		IF ARRIVAL-POINT = 'RE' OR 'LE' OR 'VM' OR 'JR' OR 'GI'
       			ADD 15 TO TEMP-AMOUNT
       		ELSE IF ARRIVAL-POINT = 'BG' OR 'AC' OR 'AN' OR 'KA'
       			ADD 20 TO TEMP-AMOUNT
       		ELSE 
       			ADD 25 TO TEMP-AMOUNT
       		END-IF
       		
       	 ELSE IF DEPARTURE-POINT = 'VM'
       		IF ARRIVAL-POINT = 'RE' OR 'LE' OR 'PU' OR 'JR' OR 'GI'
      - 							OR 'BG'
       			ADD 15 TO TEMP-AMOUNT
       		ELSE IF ARRIVAL-POINT = 'AC' OR 'AN' OR 'KA'
       			ADD 20 TO TEMP-AMOUNT
       		ELSE 
       			ADD 25 TO TEMP-AMOUNT
       		END-IF
       	
       	 ELSE IF DEPARTURE-POINT = 'JR'
       		IF ARRIVAL-POINT = 'LE' OR 'PU' OR 'VM' OR 'GI' OR 'BG'
      - 		OR 'AC'
       			ADD 15 TO TEMP-AMOUNT
       		ELSE 	
       			ADD 20 TO TEMP-AMOUNT
       		
       		END-IF
       	
       	 ELSE IF DEPARTURE-POINT = 'GI'
       		IF ARRIVAL-POINT = 'PU' OR 'VM' OR 'JR' OR 'BG' OR 'AC'
      - 							OR 'AN'
       			ADD 15 TO TEMP-AMOUNT
       		ELSE 
       			ADD 20 TO TEMP-AMOUNT
       		
       		END-IF
       	
       	 ELSE IF DEPARTURE-POINT = 'BG'
       		IF ARRIVAL-POINT = 'VM' OR 'JR' OR 'GI' OR 'AC' OR 'AN'
      - 							OR 'KA'
       			ADD 15 TO TEMP-AMOUNT
       		ELSE 
       			ADD 20 TO TEMP-AMOUNT
       		
       		END-IF
       		
       	 ELSE IF DEPARTURE-POINT = 'AC'
       		IF ARRIVAL-POINT = 'JR' OR 'GI' OR 'BG' OR 'AN' OR 'KA'
      - 							OR 'SA'
       			ADD 15 TO TEMP-AMOUNT
       		ELSE 
       			ADD 20 TO TEMP-AMOUNT
       		
       		END-IF
       	 
       	 ELSE IF DEPARTURE-POINT = 'AN'
       		IF ARRIVAL-POINT = 'GI' OR 'BG' OR 'AC' OR 'KA' OR 'SA'
      	
       			ADD 15 TO TEMP-AMOUNT
       		ELSE IF ARRIVAL-POINT = 'LE' OR 'PU' OR 'VM' OR 'JR'
       			ADD 20 TO TEMP-AMOUNT
       		ELSE 
       			ADD 25 TO TEMP-AMOUNT
       		END-IF
       	 
       	 ELSE IF DEPARTURE-POINT = 'KA'
       		IF ARRIVAL-POINT = 'BG' OR 'AC' OR 'AN' OR 'SA'	
       			ADD 15 TO TEMP-AMOUNT
       		ELSE IF ARRIVAL-POINT = 'PU' OR 'VM' OR 'JR' OR 'GI'
       			ADD 20 TO TEMP-AMOUNT
       		ELSE 
       			ADD 25 TO TEMP-AMOUNT
       		END-IF
       		
       	 ELSE
       		IF ARRIVAL-POINT = 'AC' OR 'AN' OR 'KA'	
       			ADD 15 TO TEMP-AMOUNT
       		ELSE IF ARRIVAL-POINT = 'JR' OR 'GI' OR 'BG'
       			ADD 20 TO TEMP-AMOUNT
       		ELSE 
       			ADD 25 TO TEMP-AMOUNT
       		END-IF
       				 			
       	END-IF.