       IDENTIFICATION DIVISION.
       PROGRAM-ID. AVERAGE.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VALIDATE-INPUT		PIC X(1).
       01 NUMBER-OF-QUIZZES	PIC 9(3).
       01 QUIZ				PIC 9(3).
       01 QUIZ-TOTAL			PIC 9(5)V9(2).
       01 QUIZ-FORMATTED		PIC Z(9).9(2).
       01 COUNTER				PIC 9(2) VALUE 1.
       
       PROCEDURE DIVISION.
       
       MAIN-PROGRAM.
       	DISPLAY 'NUMBER OF QUIZZES: ' WITH NO ADVANCING.
      	ACCEPT VALIDATE-INPUT.
      	IF VALIDATE-INPUT IS NOT NUMERIC
      		DISPLAY 'NOT NUMERIC'
      		GO TO MAIN-PROGRAM
      	ELSE
      		MOVE VALIDATE-INPUT TO NUMBER-OF-QUIZZES
      		PERFORM MAIN-PARA
      	END-IF
       	STOP RUN.
      
       MAIN-PARA.
       	PERFORM GRADE-INPUT-PARA UNTIL COUNTER > NUMBER-OF-QUIZZES.
       	PERFORM COMPUTE-TOTAL-PARA.
       	DISPLAY 'AVERAGE: ' QUIZ-FORMATTED.
       	PERFORM EVALUATE-REMARK-PARA.
      
       GRADE-INPUT-PARA.
       	DISPLAY 'QUIZ #' COUNTER ': ' WITH NO ADVANCING.
       	ACCEPT QUIZ.
       	ADD QUIZ TO QUIZ-TOTAL.
       	ADD 1 TO COUNTER.
       	
       COMPUTE-TOTAL-PARA.
      	DIVIDE NUMBER-OF-QUIZZES INTO QUIZ-TOTAL.
       	MOVE QUIZ-TOTAL TO QUIZ-FORMATTED.
       	
       EVALUATE-REMARK-PARA.
       	EVALUATE QUIZ-TOTAL > 74
       		WHEN TRUE
       			DISPLAY 'REMARK: PASSED'
       		WHEN FALSE
       			DISPLAY 'REMARK: FAILED'
       	END-EVALUATE.